Repository: giellalt/corpus-fin
Catalog: tmx/sme/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=488_lang=finnish.html.tmx
Source language: fin
Languages: sme

source: Synnyit melkein hillasuolle, äitini tapaa vitsailla sukulaisille minusta.
sme: Don goas it riegát luomejeaggái, eadni láve leikošit fulkkiide mu birra.

source: Olen kotoisin Ivalosta, jossa asuin 17 pitkää vuotta.
sme: Lean eret Avvilis, gos ássen 17 guhkes jagi.

source: Kyllähän Ivalo on kaunis ja mukava paikka, mutta on ollut todella ihana päästä tuulettumaan kaupungin uusiin tuuliin.
sme: Galhan Avvil lea čáppa ja somás báiki, muhto leamašan duođaid somá beassat havssašit ođđa biekkaid gávpogii.

source: Opiskelen tällä hetkellä Oulussa lukion toista vuotta ja minusta tulee jonain päivänä vielä psykologi, sen olen päättänyt.
sme: Stuđeren dál Oulus logahaga nuppi jagi ja mus šaddá muhtun beaivve vel psykologa, nu lean mearridan.

source: Haluaisin muuttaa ulkomaille heti kun olen saanut opintoni päätökseen.
sme: Hálidivččen fárret olgoriikkaide dalán go lean geargan oahpuiguin.

source: Ja haluan ehdottomasti päästä vaikuttamaan asioihin, siksi olen myös todella kiinnostunut politiikasta.
sme: Ja hálidan áinnas beassat váikkuhit áššiide, danin lean maid duođaid beroštuvvan politihkas.

source: Tykkään hullutella ja pidän aina hauskaa, oli tilanne mikä tahansa.
sme: Liikon dádjut ja suohtastallat, lei dal dilli makkár beare.

source: Harrastan kaikkea mahdollista luovaa kuten esimerkiksi maalaamista, runoilua ja valokuvaamista.
sme: Mus lea beroštupmi máŋggalágan kreatiivvalaš astoáigge doaimmaide nugo ovdamearkka dihte málemii, divttaid čállimii ja govvemii.

source: Teen myös saamenkäsitöitä aina kun niille löydän aikaa.
sme: Duddjon maiddái sámedujiid álo go dasa báhcá áigi.

source: Tällä hetkellä olet tekemässä itselleni koulukäyttöön sisnalaukkua.
sme: Dál lean duddjomin alccen skuvlaatnui sistelávkka.

source: Äitini on oikea mestari saamenkäsitöissä ja olen ylpeä että minulla on kotona mahdollisuus oppia niiden tekemistä.
sme: Eadni lea njulgestaga meašttir sámedujiin ja lean movtta ahte mus lea ruovttus vejolašvuohta oahpahallat duddjoma.

source: Saamelaisuus on minulle tärkeää enkä haluaisi kuulua mihinkään muuhun kulttuuriin.
sme: Sápmelašvuohta lea munnje dehálaš inge hálidivčče gullat mange eará kultuvrii.

source: Kotonani ei ole koskaan oikeastaan puhuttu saamea ja en sitä itsekään osaa.
sme: Ruovttus ii leat iešalddes goasge hállon sámegiella inge iešge máhte dan.

source: Harmittaa ihan vietävästi, pakko myöntää.
sme: Duođaid vahát mu mielas, bággu mieđihit.

source: Kieli on kuitenkin niin valtava osa kulttuuria ja minä jään paitsi siitä osasta.
sme: Giella lea goit nu stuorra oassi kultuvrra ja mun bázán dan haga.

source: Olen opiskellut pohjoissaamea huikeat 11 vuotta, ala-asteelta lukioon ja silti en osaa.
sme: Lean lohkan davvisámegiela nuge guhká go 11 jagi, vuolledásis logahahkii ja dattetge in máhte.

source: Nyt opiskeluni on kuitenkin jäänyt pois, kun täällä Oulussa on todella vaikeaa saada opetusta.
sme: Dál sámegiela oahput leat goit báhcán eret, go dáppe Oulus lea duođaid váttis oažžut oahpahusa.

source: Ja etäopiskelu ei oikein innosta ja tehtävien valmiiksi aikaan saaminen on hankalaa.
sme: Ja gáiddusstuđeren ii riekta movttiidahte ja bargguid lea váttis oažžut gárvvisin.

source: Minulle saamelaisuus merkitsee omia syvimpiä juuria ja kaikkea sitä mitä olen.
sme: Munnje sápmelašvuohta mearkkaša iežan čiekŋalamos ruohttasiid ja buot dan mii mun lean.

source: Käytän asusteissani saamenkäsitöitä ja haluan että minut tunnistetaan saamelaiseksi.
sme: Geavahan iežan biktasiin sámedujiid ja hálidan olbmuid oaidnit ahte lean sápmelaš.

source: Haluaisin oppia pohjoissaamen kielen että voisin puhua sitä omille lapsilleni.
sme: Hálidivččen oahppat davvisámegiela, vai sáhtášin hállat dan iežan mánáide.

source: Sama perinteiden kanssa, on hienoa että perinteet ovat säilyneet niin hyvin !
sme: Nu maiddái árbevieruiguin, lea buorre ahte árbevierut leat seilon nu bures !

source: si joukoksi perinteet pukkaavat esiin jokaisesta pienestäkin kolosta.
sme: Iihan sápmelašvuohta eanaš olbmuin oidno nuge árggas, muhto go sápmelaččat čoahkkanit oktii, de árbevierut gal maiddái oidnogohtet.

source: Saamelaisuus minusta on hieno asia ja mielestäni kaikkien saamelaisten pitäisi rohkeasti näyttää olevansa saamelaisia.
sme: Sápmelašvuohta lea fiinna ášši ja mu mielas buot sápmelaččat galggašedje roahkkadit čájehit ahte sii leat sápmelaččat.
